Revit 2026 API

# WorksetConfiguration(WorksetConfiguration) Constructor

---

Constructs a new copy of the input WorksetConfiguration object.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WorksetConfiguration(
	WorksetConfiguration other
)
```
```vb
Public Sub New (
	other As WorksetConfiguration
)
```
```cpp
public:
WorksetConfiguration(
	WorksetConfiguration^ other
)
```
```fsharp
new :
        other : WorksetConfiguration -> WorksetConfiguration
```

#### Parameters

other WorksetConfiguration

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

WorksetConfiguration Class

WorksetConfiguration Overload

Autodesk.Revit.DB Namespace